import React from 'react'
import TermHeaderBar from '../../components/TermPolicyLayout/TermHeaderBar'
const PrivacyPolicy = () => {
  return (
    <>
      <TermHeaderBar />
      <div>
        <div className='absolute w-full mx-auto my-0 top-28 bg-red-50'>
          <h1 className='text-center text-7xl my-10'>นโยบายความเป็นส่วนตัว</h1>
        </div>
        <div className='relative h-full mx-96 top-80'>
          <p className='text-xl indent-12'>
            ประกาศฉบับนี้กำหนดหลักปฏิบัติเกี่ยวกับการเก็บรวบรวม การใช้และเปิดเผยข้อมูลส่วนบุคคลตาม พ.ร.บ. คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 ประกาศฉบับนี้บังคับใช้กับผู้ใช้งานswuenbase ผู้ใช้งานได้โปรดอ่านเงื่อนไขของประกาศฉบับนี้โดยละเอียด
          </p><br /><br />
          <h1 className='text-3xl font-bold'>คำนิยาม</h1><br />
          <p className='text-xl indent-12'>“ข้อมูลส่วนบุคคล”ภายใต้ประกาศฉบับนี้ หมายถึง ข้อมูลใดๆที่เกี่ยวกับบุคคลที่ทำให้สามารถระบุตัวตนบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อมรวมทั้งข้อมูลทุกประเภทที่สามารถบ่งชี้ตัวตน ซึ่งรวมถึงแต่ไม่จำกัดเพียง ชื่อ หมายเลขประจำตัวบัตรประชาชน ข้อมูลสถานที่อยู่ ข้อมูลออนไลน์ ข้อมูลเอกลักษณ์ทางกายภาพทางจิตใจ ทางสังคม เศรษฐกิจ วัฒนธรรม หรือข้อมูลอื่นใด ที่สามารถระบุตัวตนได้
          </p><br />
          <h1 className='text-center text-5xl my-10 font-bold'>ข้อมูลที่เว็บไซต์เก็บรวบรวม</h1>
          <h1 className='text-3xl font-bold'>ข้อมูลผู้ใช้งาน</h1><br />
          <p className='text-xl indent-12'>เมื่อท่านลงทะเบียนใช้บริการของเว็ปไซด์ของเรา เราจำเป็นต้องเก็บรวบรวม</p>
          <p className='text-xl'>1.&nbsp;&nbsp;&nbsp; ประวัติ - ชื่อ นามสกุล (ไทยและอังกฤษ) ปีเกิด ศาสนา พักที่อยู่อาศัยอยู่กับ โทรศัพท์มือถือ Email อาชีพ รายได้</p>
          <p className='text-xl'>2.&nbsp;&nbsp; ข้อมูลที่อยู่ - ตำบล/แขวง อำเภอ/เขต จังหวัด</p>
          <p className='text-xl'>3.&nbsp;&nbsp; ข้อมูลการศึกษา - หลักสูตรการศึกษา สาขาวิชา จบจากโรงเรียน ประเภทเข้าการศึกษา เกรดเฉลี่ยก่อนเข้าเรียน  เกรดเฉลี่ยปัจจุบัน และได้รับข่าวสารเกี่ยวกับคณะวิศวกรรมศาสตร์จากช่องทางไหน</p>
          <p className='text-xl'>4.&nbsp;&nbsp; ข้อมูลรางวัลที่ได้รับ
            <br />-&nbsp; ระหว่างเรียน ระดับรางวัล ประเภทของรางวัลที่ได้รับ ชื่อรางวัล ผู้ที่มอบรางวัล และชั้นปีที่ได้รับ วันที่ได้รับ
            <br />-&nbsp; ตอนทำงาน ระดับรางวัล ประเภทของรางวัลที่ได้รับ ชื่อรางวัล ผู้ที่มอบรางวัล และชั้นปีที่ได้รับ วันที่ได้รับ
          </p>
          <p className='text-xl'>5.&nbsp;&nbsp; ความสามารถทางภาษา -ภาษา วันเวลาที่สอบ ชื่อแบบทดสอบที่วัดระดับความรู้ และคะแนน</p>
          <p className='text-xl'>6.&nbsp;&nbsp; ทุนการศึกษา -ประเภทของทุน ชื่อทุน ผู้มอบทุน และชั้นปีที่ได้รับ</p>
          <p className='text-xl'>7.&nbsp;&nbsp; ข้อมูลการทำงาน -ปีที่ได้ทำงาน บริษัท ตำแหน่ง และรายได้เดือนละ(เป็นช่วงระหว่าง)</p>
          <p className='text-xl'>8.&nbsp;&nbsp; ข้อมูลครอบครัว
            <br />-&nbsp; ชื่อพ่อแม่ อาชีพพ่อแม่ รายได้ปีละ(พ่อแม่) สถานภาพสมรสของบิดามารดา  จำนวนพี่น้อง
            <br />-&nbsp; ทำงาน อายุ การศึกษาสูงสุด สถานที่ทำงาน รายได้เดือนละ(เป็นช่วงระหว่าง)
          </p>
          <p className='text-xl'>9.&nbsp;&nbsp; การฝึกอบรม
            <br />-&nbsp; ระหว่างเรียน วันที่ฝึกอบรม หัวฝึกอบรม หน่วยงาน สถานที่ฝึกอบรม
            <br />-&nbsp; ตอนทำงาน วันที่ฝึกอบรม หัวฝึกอบรม หน่วยงาน สถานที่ฝึกอบรม
          </p>
          <p className='text-xl'>10.&nbsp;  กิจกรรมที่เข้าร่วมของคณะ
            <br />-&nbsp; ระหว่างเรียน วันที่ทำกิจกรรม ชื่อกิจกรรม หน่วยงานที่จัด
            <br />-&nbsp; ตอนทำงาน วันที่ทำกิจกรรม ชื่อกิจกรรม หน่วยงานที่จัด
          </p><br />
          <h1 className='text-3xl font-bold'>ข้อมูลส่วนบุคคลประเภทพิเศษ</h1><br />
          <p className='text-xl indent-12'>
            บริษัทเก็บข้อมูลส่วนบุคคลประเภทพิเศษของท่าน ตามมาตรา 26 ของพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562 เช่น เชื้อชาติ เผ่าพันธุ์ ความคิดเห็นทางการเมือง ความเชื่อในลัทธิ ศาสนาหรือปรัชญา พฤติกรรมทางเพศ ประวัติอาชญากรรม ข้อมูลสุขภาพ ความพิการ ข้อมูลสหภาพแรงงาน ข้อมูลพันธุกรรม ข้อมูลชีวภาพ หรือข้อมูลอื่นใดที่มีลักษณะเดียวกัน โดยบริษัทจะเข้าถึง เก็บรวบรวม ใช้ เปิดเผย หรือควบคุมข้อมูลส่วนบุคคลด้วยความระมัดระวังตามขอบเขตที่กฎหมายกำหนด เราจะแจ้งข้อมูลรายละเอียดการเก็บรวบรวม ใช้ หรือเปิดเผย ข้อมูลส่วนบุคคลประเภทพิเศษดังกล่าวต่อท่านก่อนหรือขณะที่เรา 	เก็บรวบรวมข้อมูลจากท่านภายใต้เงื่อนไขหลักเกณฑ์ที่กฎหมายกำหนด
          </p><br />
          <h1 className='text-3xl font-bold'>ข้อมูลส่วนบุคคลที่เกี่ยวข้องกับการกระทำความผิดกฎหมาย</h1><br />
          <p className='text-xl indent-12'>
            ท่านรับทราบว่า ในกรณีที่มีการกระทำความผิดตามกฎหมายเกิดขึ้น ไม่ว่าจะเป็นความผิดในทางแพ่งหรือทางอาญาหรือกฎหมายอื่นใด บริษัทมีสิทธิเก็บรวบรวมหรือใช้ข้อมูลการกระทำความผิดกฎหมายของท่านได้ โดยบริษัทจะเข้าถึง เก็บรวบรวม เปิดเผย หรือควบคุมข้อมูลส่วนบุคคลด้วยความระมัดระวังตามขอบเขตที่กฎหมายกำหนด
          </p><br />
          <br />
          <h1 className='text-3xl font-bold'>วัตถุประสงค์ของการเก็บรวบรวม </h1><br />
          <p className='text-xl indent-12'>
            ใช้หรือเปิดเผยข้อมูลส่วนบุคคล เราจะดำเนินการประมวลผลข้อมูลส่วนบุคคลโดยมีวัตถุประสงค์ ขอบเขต และใช้วิธีการ ที่ชอบด้วยกฎหมาย โปร่งใสและเป็นธรรม โดยจะประมวลผลข้อมูลส่วนบุคคลตามประเภทข้อมูลส่วนบุคคลที่มี การเก็บรวบรวม ใช้ หรือเปิดเผยตามความจำเป็น เพื่อตรวจสอบความถูกต้องของข้อมูลที่ได้ให้ไว้กับทางคณะวิศวกรรมศาสตร์มหาวิทยาลัยศรีนครินทรวิโรฒ
            <br />โดยมีวัตถุประสงค์ระบุดังต่อไปนี้
          </p><br />
          <p className='text-xl'>3.1&nbsp;  เพื่อสร้างระบบเก็บรวบรวมข้อมูลเชิงลึกของนิสิตคณะวิศวกรรมศาสตร์ศรีนครินทรวิโรฒ</p>
          <p className='text-xl'>3.2 เพื่อสร้างระบบเก็บรวบรวมข้อมูลที่คณะวิศวกรรมศาสตร์สามารถเพิ่มเติมตัวชี้วัดได้เอง</p>
          <p className='text-xl'>3.3 เพื่อนำไปวิเคราะห์หรือนำไปอ้างอิงในการปรับปรุงกิจกรรมของนิสิตคณะวิศวกรรมศาสตร์มหาวิทยาลัยศรีนครินทรวิโรฒ</p>
          <p className='text-xl'>3.4 เพื่อใช้ในการบันทึกกิจกรรมของนิสิต</p>
          <p className='text-xl'>3.5 เพื่อใช้เป็นการเก็บรวบรวมการได้รับรางวัล</p>
          <p className='text-xl'>3.6 เพื่อใช้ในการสอบถามข้อมูลนิสิตที่ในปกครองของตนเองเพื่อช่วยในการดูแลและติดตามนิสิต</p>
          <p className='text-xl'>3.7 เพื่อใช้ในการเก็บข้อมูลศิษย์เก่า</p>
          <p className='text-xl'>3.8 เพื่อใช้ในการจัดทำแบบประเมินภาวะการมีงานทำของบัณฑิตแบบออนไลน์และรายงานผลให้ผู้บริหารและหน่วยงานที่เกี่ยวข้อง</p>
          <br />
          <h1 className='text-3xl font-bold'>ระยะเวลาในการจัดเก็บข้อมูล</h1><br />
          <p className='text-xl indent-12'>เราจะดำเนินการจัดเก็บข้อมูลส่วนบุคคลของนิสิตตลอดระยะเวลาศึกษาหรือตามสัญญาที่ปฏิบัติระหว่างกัน แต่เราอาจจะยังคงเก็บข้อมูลส่วนบุคคลของนิสิตต่อไปหากเห็นว่ายังมีความจำเป็นหรือตามที่กฏหมายกำหนด</p><br />
          <h1 className='text-3xl font-bold'>มาตรการด้านความปลอดภัย</h1><br />
          <p className='text-xl'>5.1&nbsp; มีการจำกัดการเข้าถึง ซึ่งจะเข้าถึงได้ตามสิทธิ์การเข้าถึงตามที่ได้รับอนุญาตเท่านั้น </p>
          <p className='text-xl'>5.2 มีการสำรองข้อมูลส่วนบุคคล ให้เป็นไปตามแผนสำรองและกู้คืนข้อมูล</p>
        </div>
      </div>
    </>
  )
}

export default PrivacyPolicy