import React from 'react'
import TermHeaderBar from '../../components/TermPolicyLayout/TermHeaderBar'
const TermsAndConditions = () => {
  return (
    <>
      <TermHeaderBar />
      <div>
        <div className='absolute w-full mx-auto my-0 top-28 bg-red-50'>
          <h1 className='text-center text-7xl my-10'>ข้อตกลงและเงื่อนไขการใช้บริการเว็บไซต์</h1>
        </div>
        <div className='relative h-full mx-96 top-80'>
          <p className='text-xl'>
            ยินดีต้อนรับสู่เว็บไซต์ โดยการใช้บริการของเว็บไซต์นี้จะถือว่าคุณยอมรับข้อกำหนดและเงื่อนไขดังต่อไปนี้
          </p><br /><br />
          <h1 className='text-3xl font-bold'>การใช้บริการ</h1><br />
          <p className='text-xl'>1.1&nbsp;&nbsp;คุณต้องใช้บริการของเว็บไซต์นี้เพื่อวัตถุประสงค์ที่ถูกต้องเท่านั้น และไม่ได้ใช้บริการเพื่อการกระทำผิดกฎหมายหรือการกระทำที่ไม่เหมาะสม </p>
          <p className='text-xl'>1.2&nbsp;เราสามารถระงับหรือยกเลิกบริการของคุณได้โดยไม่ต้องแจ้งให้ทราบล่วงหน้าหากพบว่าคุณได้ละเมิดข้อตกลงและเงื่อนไขการใช้บริการของเรา</p><br />
          <h1 className='text-3xl font-bold'>การสมัครสมาชิก</h1><br />
          <p className='text-xl'>2.1&nbsp; คุณต้องลงทะเบียนและสมัครสมาชิกก่อนใช้บริการเว็บไซต์</p>
          <p className='text-xl'>2.2 ข้อมูลที่คุณให้ต้องเป็นความจริงและถูกต้องทุกประการ</p>
          <p className='text-xl'>2.3 คุณต้องรักษาความลับของชื่อผู้ใช้และรหัสผ่านของคุณเอาไว้ และไม่เปิดเผยให้บุคคลภายนอก</p><br />
          <h1 className='text-3xl font-bold'>การใช้งานข้อมูล</h1><br />
          <p className='text-xl'>3.1&nbsp; เราจะเก็บข้อมูลที่คุณให้มาเพื่อให้บริการในเว็บไซต์และ	ข้อมูลที่เก็บมาได้จะนำไปวิเคราะห์หรือนำไปอ้างอิงในการปรับปรุงกิจกรรมของนิสิตคณะวิศวกรรมศาสตร์มหาวิทยาลัยศรีนครินทรวิโรฒเท่านั้น และจะไม่เปิดเผยข้อมูลของคุณให้แก่บุคคลภายนอกโดยไม่ได้รับอนุญาต </p>
          <p className='text-xl'>3.2 เราจะใช้ข้อมูลของคุณเพื่อปรับปรุงและพัฒนาโดยที่ข้อมูลที่เก็บมาได้จะนำไปวิเคราะห์หรือนำไปอ้างอิงในการปรับปรุงกิจกรรมของนิสิตคณะวิศวกรรมศาสตร์มหาวิทยาลัยศรีนครินทรวิโรฒ และไม่นำข้อมูลของคุณไปใช้ในวัตถุประสงค์อื่นๆ โดยไม่ได้รับอนุญาตจากคุณ </p>
          <p className='text-xl'>3.3 เราจะรักษาความปลอดภัยของข้อมูลของคุณโดยใช้มาตรการที่เหมาะสมเพื่อป้องกันการเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต</p><br />
          <h1 className='text-3xl font-bold'>การเปลี่ยนแปลงข้อกำหนดและเงื่อนไขการใช้บริการ</h1><br />
          <p className='text-xl'>4.1&nbsp; เราสงวนสิทธิ์ในการเปลี่ยนแปลงข้อกำหนดและเงื่อนไขการใช้บริการโดยไม่ต้องแจ้งให้ทราบล่วงหน้า</p>
          <p className='text-xl'>4.2 การเปลี่ยนแปลงข้อกำหนดและเงื่อนไขการใช้บริการจะมีผลใช้งานตั้งแต่วันที่เปลี่ยนแปลงถูกประกาศขึ้นในเว็บไซต์</p><br />
          <h1 className='text-3xl font-bold'>การละเมิดลิขสิทธิ์</h1><br />
          <p className='text-xl'>5.1&nbsp; เราจะไม่รับข้อมูลที่ละเมิดลิขสิทธิ์ของบุคคลอื่น</p>
          <p className='text-xl'>5.2 หากพบว่ามีข้อมูลที่ละเมิดลิขสิทธิ์ถูกเก็บบนเว็บไซต์ของเรา เราจะดำเนินการลบข้อมูลดังกล่าวทันทีโดยไม่ต้องแจ้งให้ทราบล่วงหน้า</p>
          <p className='text-xl'>5.3 เราจะดำเนินการตามกฎหมายที่เกี่ยวข้องในกรณีที่มีการละเมิดลิขสิทธิ์ของบุคคลอื่นเกิดขึ้นในเว็บไซต์ของเรา</p><br />
          <h1 className='text-3xl font-bold'>การยกเลิกบริการ</h1><br />
          <p className='text-xl'>6.1&nbsp; เราสงวนสิทธิ์ในการยกเลิกบริการหากคุณไม่ปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้บริการหรือเกิดการละเมิดลิขสิทธิ์ของบุคคลอื่นบนเว็บไซต์ของเรา</p>
          <p className='text-xl'>6.2 เราไม่รับผิดชอบในความเสียหายที่เกิดจากการยกเลิกบริการ</p><br />
          <h1 className='text-3xl font-bold'>การคุ้มครองข้อมูลส่วนบุคคล </h1><br />
          <p className='text-xl'>7.1&nbsp; เรายึดตามนโยบายคุ้มครองข้อมูลส่วนบุคคลของเราที่สอดคล้องกับกฎหมายคุ้มครองข้อมูลส่วนบุคคล</p>
          <p className='text-xl'>7.2 เราจะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้เพียงเท่าที่จำเป็นเท่านั้น และจะไม่เก็บรักษาข้อมูลของคุณเกินระยะเวลาที่จำเป็น</p><br />

        </div>
      </div>
    </>
  )
}

export default TermsAndConditions